{
	"title": "Drops: 생태계 전반의 분배 메커니즘",
	"q1": "Drops 시스템이란 무엇인가요?",
	"q1p1": "Drops 시스템은 전체 생태계에 서비스를 제공하도록 설계된 최소한의 스마트 계약입니다.",
	"q1p2": "Drops 시스템의 핵심은 누구나 RAM으로 지원되는 대체 불가능한 데이터를 만들고 관리할 수 있는 스마트 계약입니다. 이 데이터는 가치 단위로 단독으로 사용할 수 있으며 다른 응용 프로그램에서 고유성을 위해 활용할 수 있습니다. Drops 시스템의 유일한 목적은 이 데이터를 관리하고 유용성을 향상시키는 것입니다.",
	"q1p3": "누구나 이 시스템을 사용하여 자신의 네트워크 리소스를 사용하여 원하는 만큼 고유한 드롭을 만들 수 있습니다. 또한 모든 개발자는 자신의 애플리케이션에서 이 시스템과 고유한 데이터를 입증 가능한 공정한 방식으로 자유롭게 활용할 수 있습니다.",
	"q2": "개별 Drops란 무엇인가요?",
	"q2p1": "각 개별 드롭은 특정 계정이 소유한 고유하고 대체 불가능한 데이터입니다. 단독으로 고유성과 고유한 가치를 제공하는 기본 데이터 유형입니다.",
	"q2p2": "드롭(Drop)은 UTXO 기반 블록체인에서 볼 수 있는 서수(Ordinal)와 유사합니다. Drop을 만들 때 대체 가능한 RAM의 {{sizeDropRow}} bytes를 사용하여 대체 불가능한 서수로 변환합니다. 일단 생성되면 거래, 파괴 또는 다른 계약 및 응용 프로그램(게임 내 아이템, 각문, NFT 등)의 논리에서 고유한 데이터로 사용할 수 있습니다.",
	"q2p3": "UTXO 체인의 서수와 달리 드롭은 사용되지 않은 토큰 출력과 연결되지 않고 대신 계정이 소유합니다. UTXO에 대한 의존성이 없다면, Drop을 만드는데 사용된 값의 일부를 회수하기 위해 Drop을 소멸시킬 수 있습니다. 이렇게 하면 모든 Drop에 Drop을 만드는 데 사용된 RAM의 양과 관련된 고유 값이 부여됩니다.",
	"q3": "드롭은 어디에 사용할 수 있나요?",
	"q3p1": "단순히 가치 저장소로 존재하는 것 외에도 Drops는 고유한 속성을 위해 다른 응용 프로그램에서 활용할 수 있습니다. 다른 응용 프로그램에서 Drop을 사용하는 것은 여러 가지 방법으로 발생할 수 있으며, 이는 다른 응용 프로그램의 작성자가 결정합니다. 애플리케이션에는 간단한 소유권 확인이 필요하거나, 특정 Epoch의 Drop에 대한 확인이 필요하거나, 특정 Drop의 전송이 필요하거나, 참여를 위해 Drop을 파기해야 할 수 있습니다.",
	"q3p2a": "Drop의 고유성은 다음과 같이 사용할 수도 있습니다.",
	"q3p2b": "시드 데이터(seed data)",
	"q3p2c": "고유 한 소유권 (비문과 유사)을 나타내거나 다음을 사용하는 알고리즘에서 Oracle 시스템과 결합 된 다른 응용 프로그램",
	"q3p2d": "의사 난수",
	"q3p2e": "또는",
	"q3p2f": "절차적 생성(procedural generation)",
	"q3p2g": "기술을.",
	"q3p3": "시스템 자체는 다른 응용 프로그램에서 Drops를 사용하는 것과 무관합니다. Drops 사용 방법을 결정하는 것은 해당 응용 프로그램 제작자의 몫입니다.",
	"q4": "드롭은 어떻게 만드나요?",
	"q4p1": "드롭은 생성 페이지에서 만들 수 있습니다. 이 페이지에서는 사용자가 생성할 드롭 수를 선택할 수 있으며 관련된 토큰/리소스 비용에 대한 자세한 분석을 보여줍니다.",
	"q4p2": "현재 Drop을 만드는 두 가지 방법을 제공합니다.",
	"q4p3a": "토큰을 사용하여 RAM 자동 구매",
	"q4p3a1": "토큰 잔액이 있는 계정은 토큰을 스마트 계약으로 직접 전송하여 하나 이상의 드롭을 생성할 수 있습니다. 스마트 컨트랙트는 수신한 토큰을 사용하여 요청된 드롭의 양을 생성하는 데 필요한 정확한 양의 RAM을 자동으로 구매합니다.",
	"q4p3a2": "이 전송 중에 전송된 초과 토큰 중 Drops 생성을 위한 RAM 구매에 사용되지 않은 토큰은 자동으로 발신자에게 반환됩니다.",
	"q4p3a3": "이 메서드를 사용하면 바인딩되지 않은 Drop이 생성됩니다. 스마트 계약은 드롭이 파괴되거나 나중에 특정 계정에 바인드될 때까지 드롭을 생성하는 데 사용되는 RAM 리소스를 제어합니다.",
	"q4p4a": "계정 소유 RAM 할당량 사용",
	"q4p4a1": "사용 가능한 RAM 할당량이 있는 계정은 자체 리소스를 사용하여 하나 이상의 Drops를 생성할 수 있습니다. 이 방법을 사용하여 드롭을 생성하면 크리에이터 계정에서 직접 필요한 정확한 RAM 용량이 사용됩니다.",
	"q4p4a2": "이 메서드를 사용하면 Drop을 만든 계정에 바인딩된 Drop이 만들어집니다. Drop을 만든 계정은 Drop을 만드는 데 사용된 RAM 리소스에 대한 제어를 유지합니다. 향후 바인딩을 해제하지 않는 한 거래할 수 없습니다. 바인딩된 Drop이 파괴되면 사용된 RAM이 소유자에게 해제됩니다.",
	"q5": "바운드 드롭과 언바운드 드롭은 무엇인가요?",
	"q5p1": "존재하는 모든 Drop은 바인딩되거나 바인딩되지 않습니다.",
	"q5p2": "이 속성은 개별 Drop의 두 가지 측면에 영향을 줍니다.",
	"q5p3a": "기술적으로 Drop을 지원하는 RAM을 보유하는 사람.",
	"q5p3b": "드롭을 다른 계정으로 거래할 수 있는지 여부.",
	"q5p4": "바인딩된 드롭은 특정 계정에 잠겨 있으며 거래할 수 없습니다. 바운드 드롭의 기본 RAM 리소스는 현재 소유자가 제어합니다. 이것의 반대는 언바운드된 드롭으로, 잠금 해제되어 다른 계정으로 거래할 수 있습니다. 언바운드 드롭의 기본 RAM 리소스는 스마트 컨트랙트에 의해 제어되며, 이를 통해 계정 간에 자유롭게 거래할 수 있습니다.",
	"q5p5": "각 드롭은 드롭의 소유자가 언제든지 이 두 상태 간에 전환할 수 있습니다. 바운드와 언바운드 사이를 전환하려면 현재 소유자가 작업에 대한 네트워크 요금을 지불해야 할 뿐만 아니라 자체 EOS 및/또는 RAM을 사용하여 이 두 상태 간에 드롭을 전환해야 합니다.",
	"q6": "Drops를 생성할 때 수수료가 있나요?",
	"q6p1": "예, 드롭을 생성하려면 네트워크 요금이 필요합니다.",
	"q6p2": "네트워크 수수료는 드롭을 생성하는 데 사용된 리소스에 대해 네트워크에 지불됩니다. 수수료는 EOS 및 RAM으로 지불되며 드롭을 생성하는 데 사용된 RAM의 양을 기준으로 계산됩니다.",
	"q6p3": "Drop을 만들면 CPU, NET 및 RAM의 3가지 기본 네트워크 리소스가 모두 사용됩니다. 시스템 컨트랙트에 대한 RAM 구매 및 판매에는 0.5%의 수수료가 있습니다. CPU와 NET의 렌탈도 Powerup 시스템을 통한 비용이 듭니다. 이러한 시스템에서 징수된 모든 수수료는 REX(리소스 거래소)에 토큰을 스테이킹하는 EOS 토큰 보유자에게 지급됩니다.",
	"q6p4": "Drops 시스템에서는 추가 비용을 부담하지 않습니다.",
	"q6p5a": "Drops 스마트 계약은 항상 토큰 잔액이 0으로 유지됩니다. Drops 스마트 컨트랙트의 RAM 잔액은 Drops가 생성되고 다음과 같은 이유로 파괴됨에 따라 시간이 지남에 따라 천천히 증가합니다. ",
	"q6p5b": "Bancor 알고리즘의 정밀도에서 해결되지 않은 버그입니다.",
	"q6p5c": "이 추가 RAM은 추가 데이터 저장을 위해 계약에 의해 사용됩니다.",
	"q7": "Epoch란 무엇입니까?",
	"q7p1": "epoch는 Drops 프로젝트가 시작된 이후의 시간을 나타내는 간단한 숫자 표현입니다. Drops 프로젝트가 시작되면 epoch 1이 시작됩니다. 일정 시간이 지나면 Epoch가 2로 진행됩니다. 이 프로세스는 스마트 계약의 수명 동안 반복됩니다.",
	"q7p2": "생성된 각 드롭은 생성된 에포크에 자동으로 연결됩니다. Drop이 생성되면 미성숙 상태에서 시작하여 다음 에포크까지 그대로 유지됩니다. 다음 에포크가 시작되면 드롭은 성숙한 것으로 간주되며 다른 응용 프로그램 및 알고리즘에서 사용하기 위해 오라클에서 제공하는 에포크 시드와 결합할 수 있습니다.",
	"q8": "오라클이란 무엇입니까?",
	"q8p1": "오라클은 각 Epoch에 대한 무작위 시드를 제공하는 지정 계정입니다. 각 epoch 동안 이러한 오라클은 암호화 알고리즘 및 기타 응용 프로그램에서 사용할 고유한 솔트를 추가하기 위해 커밋 및 공개 프로세스에 참여합니다.",
	"more": "추가 정보",
	"morep1": "이 문서는 계속 발전할 것이며 커뮤니티 피드백이 접수되는 대로 더 많은 정보가 추가될 것입니다. 이것은 본질적으로 Drops의 살아있는 백서의 시작입니다.",
	"morep2": "이 프로젝트와 관련된 토론을 위해 텔레그램 채널이 여기에 생성되었습니다."
}
